marcelkottmann/esp32-javascript/main/main.cpp
/*
MIT License

Copyright (c) 2018 Marcel Kottmann

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
*/

#include <stdio.h>
#include <string.h>
#include <stddef.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_system.h"
#include <duktape.h>
#include "tcp.h"
#include "esp_event.h"
#include "esp_system.h"
#include "freertos/event_groups.h"
#include "esp_wifi.h"
#include "esp_event_loop.h"
#include "esp_log.h"
#include "nvs_flash.h"
#include "freertos/timers.h"
#include "lwip/err.h"
#include "lwip/arch.h"
#include "lwip/api.h"
#include <lwip/sockets.h>
#include "nvs.h"
#include <netdb.h>
#include "rom/uart.h"
#include "esp32-hal-gpio.h"
#include "esp32-hal-ledc.h"
#include "pins_arduino.h"
#include "main.h"

static EventGroupHandle_t wifi_event_group;
static const int CONNECTED_BIT = BIT0;

static const char *tag = "esp32-javascript";

// global task handle
TaskHandle_t task;
xQueueHandle el_event_queue;

TaskHandle_t stask;
int notConnectedSockets_len = 0;
int *notConnectedSockets = NULL;
int connectedSockets_len = 0;
int *connectedSockets = NULL;

int selectClientSocket = -1;
int selectServerSocket = -1;
struct sockaddr_in target;
SemaphoreHandle_t xSemaphore;
bool needsUnblock = false;

bool flag = false;

#define EL_TIMER_EVENT_TYPE 0
#define EL_WIFI_EVENT_TYPE 1
#define EL_SOCKET_EVENT_TYPE 2

#define EL_WIFI_STATUS_DISCONNECTED 0
#define EL_WIFI_STATUS_CONNECTED 1
#define EL_WIFI_STATUS_CONNECTING 2

#define EL_SOCKET_STATUS_WRITE 0
#define EL_SOCKET_STATUS_READ 1
#define EL_SOCKET_STATUS_ERROR 2

void IRAM_ATTR el_add_event(eventlist_t *events, timer_event_t *event)
{
    events->events[events->events_len] = *event;
    events->events_len = events->events_len + 1;
}

void IRAM_ATTR el_fire_events(eventlist_t *events)
{
    if (events->events_len > 0)
    {
        ESP_LOGD(tag, "Send %d events to queue...\n", events->events_len);
        xQueueSendFromISR(el_event_queue, events, NULL);
    }
}

void IRAM_ATTR el_create_event(timer_event_t *event, int type, int status, int fd)
{
    event->type = type;
    event->status = status;
    event->fd = fd;
}

void IRAM_ATTR vTimerCallback(TimerHandle_t xTimer)
{
    timer_event_t event;
    eventlist_t events;

    xTimerDelete(xTimer, portMAX_DELAY);

    el_create_event(&event, EL_TIMER_EVENT_TYPE, (int)xTimer, 0);
    events.events_len = 0;
    el_add_event(&events, &event);
    el_fire_events(&events);
}

static IRAM_ATTR esp_err_t event_handler(void *ctx, system_event_t *sysevent)
{
    eventlist_t events;
    events.events_len = 0;

    timer_event_t event;
    timer_event_t event2;

    switch (sysevent->event_id)
    {
    case SYSTEM_EVENT_STA_START:
        el_create_event(&event, EL_WIFI_EVENT_TYPE, EL_WIFI_STATUS_CONNECTING, 0);
        el_add_event(&events, &event);
        esp_wifi_connect();
        break;
    case SYSTEM_EVENT_STA_GOT_IP:
        xEventGroupSetBits(wifi_event_group, CONNECTED_BIT);
        el_create_event(&event, EL_WIFI_EVENT_TYPE, EL_WIFI_STATUS_CONNECTED, 0);
        el_add_event(&events, &event);
        break;
    case SYSTEM_EVENT_STA_DISCONNECTED:
        el_create_event(&event, EL_WIFI_EVENT_TYPE, EL_WIFI_STATUS_DISCONNECTED, 0);
        el_add_event(&events, &event);

        el_create_event(&event2, EL_WIFI_EVENT_TYPE, EL_WIFI_STATUS_CONNECTING, 0);
        el_add_event(&events, &event2);

        /* This is a workaround as ESP32 WiFi libs don't currently
       auto-reassociate. */

        wifi_mode_t mode;
        esp_wifi_get_mode(&mode);
        esp_wifi_set_mode(WIFI_MODE_NULL);
        esp_wifi_set_mode(mode);
        esp_wifi_connect();
        xEventGroupClearBits(wifi_event_group, CONNECTED_BIT);
        break;
    case SYSTEM_EVENT_AP_START:
        xEventGroupSetBits(wifi_event_group, CONNECTED_BIT);
        el_create_event(&event, EL_WIFI_EVENT_TYPE, EL_WIFI_STATUS_CONNECTED, 0);
        el_add_event(&events, &event);
        break;
    case SYSTEM_EVENT_AP_STOP:
        xEventGroupClearBits(wifi_event_group, CONNECTED_BIT);
        el_create_event(&event, EL_WIFI_EVENT_TYPE, EL_WIFI_STATUS_DISCONNECTED, 0);
        el_add_event(&events, &event);
        break;
    default:
        ESP_LOGE(tag, "UNKNOWN WIFI EVENT %d\n", sysevent->event_id);
        break;
    }

    el_fire_events(&events);

    return ESP_OK;
}

int createTimer(int timer_period_us)
{
    int interval = timer_period_us / portTICK_PERIOD_MS;

    //interval must be at least 1
    if (interval <= 0)
    {
        interval = 1;
    }
    TimerHandle_t tmr = xTimerCreate("MyTimer", interval, pdFALSE, NULL, vTimerCallback);
    printf("Timer created: %d\n", (int)tmr);
    if (xTimerStart(tmr, portMAX_DELAY) != pdPASS)
    {
        ESP_LOGE(tag, "Timer start error");
    }
    return (int)tmr;
}

int createSocketPair()
{
    struct sockaddr_in server;

    ESP_LOGD(tag, "Start creating socket paair\n");
    int bits = xEventGroupGetBits(wifi_event_group);
    int connected = CONNECTED_BIT & bits;

    if (connected)
    {
        int sd = createNonBlockingSocket(AF_INET, SOCK_DGRAM, 0, true);
        if (sd >= 0)
        {
            int port = 6789;
            memset((char *)&server, 0, sizeof(server));
            server.sin_family = AF_INET;
            server.sin_addr.s_addr = htonl(INADDR_ANY);
            server.sin_port = htons(port);
            server.sin_len = sizeof(server);

            ESP_LOGD(tag, "Trying to bind socket %d...\n", sd);

